///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

Процедура ОбновитьНастройки(УзелИнформационнойБазы, ВидНастройки, ЗначениеНастройки) Экспорт
	
	ОбновитьЗапись(УзелИнформационнойБазы, "Настройки", ВидНастройки, ЗначениеНастройки);
	
КонецПроцедуры

Процедура ОбновитьНастройкиКорреспондента(УзелИнформационнойБазы, ВидНастройки, ЗначениеНастройки) Экспорт
	
	ОбновитьЗапись(УзелИнформационнойБазы, "НастройкиКорреспондента", ВидНастройки, ЗначениеНастройки);
	
КонецПроцедуры

Функция ЗначениеНастройки(УзелИнформационнойБазы, ВидНастройки) Экспорт
	
	Результат = Неопределено;
	
	ПрочитатьЗапись(УзелИнформационнойБазы, "Настройки", ВидНастройки, Результат);
	
	Возврат Результат;
	
КонецФункции

Функция ЗначениеНастройкиКорреспондента(УзелИнформационнойБазы, ВидНастройки) Экспорт
	
	Результат = Неопределено;
	
	ПрочитатьЗапись(УзелИнформационнойБазы, "НастройкиКорреспондента", ВидНастройки, Результат);
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру, содержащую поля хешируемых сумм хранилища значений.
//
// Возвращаемое значение:
//	Структура - структура хешируемых сумм хранилищ значений со следующими полями:
//		* Настройки - Строка - используется для хранения контрольной суммы хранилища Настройки.
//		* НастройкиКорреспондента - Строка - используется для хранения контрольной суммы хранилища НастройкиКорреспондента.
//
Функция НовыйДанныеХешНастроек()
	
	СтруктураХеш = Новый Структура;
	СтруктураХеш.Вставить("Настройки"              , "");
	СтруктураХеш.Вставить("НастройкиКорреспондента", "");
	
	Возврат СтруктураХеш;
	
КонецФункции

Процедура ОбновитьЗапись(УзелИнформационнойБазы, ИмяИзмерения, ВидНастройки, ЗначениеНастройки)
	
	Менеджер = СоздатьМенеджерЗаписи();
	Менеджер.УзелИнформационнойБазы = УзелИнформационнойБазы;
	Менеджер.Прочитать();
	
	НовыеНастройки = Новый Структура;
	
	Если Менеджер.Выбран() Тогда
		ТекущиеНастройки = Менеджер[ИмяИзмерения].Получить();
		КонтрольныеСуммы = Менеджер["ХешНастроек"].Получить();
	Иначе
		ТекущиеНастройки = Неопределено;
		КонтрольныеСуммы = Неопределено;
	КонецЕсли;
	
	Если КонтрольныеСуммы = Неопределено Тогда
		КонтрольныеСуммы = НовыйДанныеХешНастроек();
	КонецЕсли;
		
	Если ТипЗнч(ТекущиеНастройки) = Тип("ТаблицаЗначений") Тогда
		
		НовыеНастройки.Вставить("ПоддерживаемыеОбъекты", ТекущиеНастройки);
		
	ИначеЕсли ТипЗнч(ТекущиеНастройки) = Тип("Структура") Тогда
		
		Для Каждого ЭлементНастройки Из ТекущиеНастройки Цикл
			
			НовыеНастройки.Вставить(ЭлементНастройки.Ключ, ЭлементНастройки.Значение);
			
		КонецЦикла;
		
	КонецЕсли;
		
	НовыеНастройки.Вставить(ВидНастройки, ЗначениеНастройки);
	КонтрольнаяСуммаНовыхНастроек = ОбщегоНазначения.КонтрольнаяСуммаСтрокой(НовыеНастройки);
	
	Если КонтрольныеСуммы[ИмяИзмерения] <> КонтрольнаяСуммаНовыхНастроек Тогда
		
		ДанныеЗаписиРегистра = Новый Структура;
		ДанныеЗаписиРегистра.Вставить("УзелИнформационнойБазы", УзелИнформационнойБазы);
		ДанныеЗаписиРегистра.Вставить(ИмяИзмерения, Новый ХранилищеЗначения(НовыеНастройки, Новый СжатиеДанных(9)));
		КонтрольныеСуммы[ИмяИзмерения] = КонтрольнаяСуммаНовыхНастроек;
		ДанныеЗаписиРегистра.Вставить("ХешНастроек", Новый ХранилищеЗначения(КонтрольныеСуммы, Новый СжатиеДанных(9)));
		ОбменДаннымиСлужебный.ОбновитьЗаписьВРегистрСведений(ДанныеЗаписиРегистра, "НастройкиОбменаДаннымиXDTO");
	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПрочитатьЗапись(УзелИнформационнойБазы, ИмяИзмерения, ВидНастройки, Результат)
	
	Менеджер = СоздатьМенеджерЗаписи();
	Менеджер.УзелИнформационнойБазы = УзелИнформационнойБазы;
	
	Менеджер.Прочитать();
	
	ДанныеНастройки = Новый Структура;
	
	Если Менеджер.Выбран() Тогда
		ТекущиеНастройки = Менеджер[ИмяИзмерения].Получить();
		
		Если ТипЗнч(ТекущиеНастройки) = Тип("ТаблицаЗначений") Тогда
			
			ДанныеНастройки.Вставить("ПоддерживаемыеОбъекты", ТекущиеНастройки);
			
		ИначеЕсли ТипЗнч(ТекущиеНастройки) = Тип("Структура") Тогда
			
			Для Каждого ЭлементНастройки Из ТекущиеНастройки Цикл
				
				ДанныеНастройки.Вставить(ЭлементНастройки.Ключ, ЭлементНастройки.Значение);
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	ДанныеНастройки.Свойство(ВидНастройки, Результат);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли