///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

// АПК:1416-выкл использование локального кэша, проверка свойств внешнего объекта

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

Перем ЛокальныйКэш;
Перем ЛокальныеПараметрыЗагрузки;

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

#Область Сервис

// Новые параметры загрузки.
// 
// Возвращаемое значение:
//  Структура:
// * ДвоичныеДанныеАрхиваZIP - ДвоичныеДанные
// 
Функция НовыеПараметрыЗагрузки() Экспорт
	Результат = Новый Структура;
	Результат.Вставить("ДвоичныеДанныеАрхиваZIP");
	Возврат Результат;
КонецФункции

Процедура ЗагрузитьДанные(ПараметрыЗагрузки) Экспорт
	
	ЛокальныйКэш.Очистить();
	ЛокальныеПараметрыЗагрузки = ПараметрыЗагрузки;

	АктуальныеСсылки = ЗагрузитьJSON();
	Если ЗначениеЗаполнено(АктуальныеСсылки) Тогда
		ОтметитьНеактуальныеЗаписи(АктуальныеСсылки);		
		Обработки.ЗагрузкаКлассификатораБанков.УстановитьВерсиюКлассификатора();		
	КонецЕсли;
	
КонецПроцедуры

// Обертка, для глобальной переменной
// 
// Возвращаемое значение:
//  см. НовыеПараметрыЗагрузки
//  
Функция ПараметрыЗагрузки()
	Возврат ЛокальныеПараметрыЗагрузки;
КонецФункции

Функция КэшСвязи(КлючСвязи)
	Перем Результат;
	Если НЕ ЛокальныйКэш.Свойство(КлючСвязи, Результат) Тогда
		Результат = Новый Соответствие();
		ЛокальныйКэш.Вставить(КлючСвязи, Результат);
	КонецЕсли;
	Возврат Результат;
КонецФункции

Процедура УстановитьРеквизит(ОбъектКлассификатора, ИмяРеквизита, НовоеЗначениеРеквизита)
	СтароеЗначениеРеквизита = ОбъектКлассификатора[ИмяРеквизита];
	Если СтароеЗначениеРеквизита <> НовоеЗначениеРеквизита Тогда
		ОбъектКлассификатора[ИмяРеквизита] = НовоеЗначениеРеквизита;
	КонецЕсли;
КонецПроцедуры

Процедура ЗаписатьИзмененный(ОбъектКлассификатора)
	Если ОбъектКлассификатора.Модифицированность() Тогда
		ОбъектКлассификатора.Записать();
	КонецЕсли;	
КонецПроцедуры

Процедура ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки, ОбъектМетаданных = Неопределено, Данные = Неопределено)
	Обработки.ЗагрузкаКлассификатораБанков.ЗаписатьОшибкуВЖурналРегистрации(ТекстОшибки, ОбъектМетаданных, Данные);
КонецПроцедуры

Функция СвойствоСтруктуры(Структура, Ключ)
	Результат = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(Структура, Ключ); // АПК:1417
	Возврат Результат;
КонецФункции

#КонецОбласти

#Область ЗагрузитьJSON

Функция ЗагрузитьJSON()
	Результат = Новый Массив;	
	РеквизитыОрганизаций = РеквизитыОрганизаций();
	Для Каждого РеквизитыОрганизации Из РеквизитыОрганизаций Цикл 
		БанкСсылка = НайтиСоздатьБанк(РеквизитыОрганизации);
		Результат.Добавить(БанкСсылка);
	КонецЦикла;
	Возврат Результат;
КонецФункции

Процедура ОтметитьНеактуальныеЗаписи(АктуальныеСсылки)
	
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	КлассификаторБанков.Ссылка КАК Ссылка,
	|	КлассификаторБанков.Код КАК Код
	|ИЗ
	|	Справочник.КлассификаторБанков КАК КлассификаторБанков
	|ГДЕ
	|	НЕ КлассификаторБанков.ДеятельностьПрекращена
	|	И НЕ КлассификаторБанков.Ссылка В (&АктуальныеСсылки)";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("АктуальныеСсылки", АктуальныеСсылки);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.КлассификаторБанков");
		ЭлементБлокировки.УстановитьЗначение("Ссылка", Выборка.Ссылка);
		НачатьТранзакцию();
		Попытка
			Блокировка.Заблокировать();
			БанкОбъект = Выборка.Ссылка.ПолучитьОбъект();
			
			Если БанкОбъект <> Неопределено И БанкОбъект.Код = Выборка.Код И Не БанкОбъект.ДеятельностьПрекращена Тогда
				БанкОбъект.ДеятельностьПрекращена = Истина;
				БанкОбъект.Записать();
			КонецЕсли;
			
			ЗафиксироватьТранзакцию();
		Исключение
			ОтменитьТранзакцию();
			Подробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
			ШаблонОписания = НСтр("ru = 'Не удалось обновить сведения об участнике расчетов ""%1"" (БИК %2):
			|%3'");
			ОписаниеВЖурнал = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонОписания
				, Выборка.Ссылка
				, Выборка.Код
				, Подробно);
				
			ЗаписатьОшибкуВЖурналРегистрации(ОписаниеВЖурнал, Выборка.Ссылка.Метаданные(), Выборка.Ссылка);
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область РеквизитыОрганизаций

Функция ТекстJSON()
	АдресВременногоКаталога = ФайловаяСистема.СоздатьВременныйКаталог();	
	Попытка
		ПараметрыЗагрузки = ПараметрыЗагрузки();
		АдресАрхиваZIP = АдресВременногоКаталога + "bic.zip";
		ПараметрыЗагрузки.ДвоичныеДанныеАрхиваZIP.Записать(АдресАрхиваZIP);

		ЧтениеАрхива = Новый ЧтениеФайлаАрхива(АдресАрхиваZIP);
		ЧтениеАрхива.ИзвлечьВсе(АдресВременногоКаталога);

		ИмяФайла = "bic-classifier.json";
		ФайлыКлассификатора = НайтиФайлы(АдресВременногоКаталога, ИмяФайла, Истина);
		Если ЗначениеЗаполнено(ФайлыКлассификатора) Тогда
			ПутьКФайлуБИК = ФайлыКлассификатора[0].ПолноеИмя;
			
			ЧтениеТекста = Новый ЧтениеТекста(ПутьКФайлуБИК, КодировкаТекста.UTF8);
			Результат = ЧтениеТекста.Прочитать();
			ЧтениеТекста.Закрыть();
		Иначе
			ТекстИсключения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = 'Не найден файл %1'"), ИмяФайла);
			ВызватьИсключение ТекстИсключения;
		КонецЕсли;
		
		ФайловаяСистема.УдалитьВременныйКаталог(АдресВременногоКаталога);
	Исключение
		ФайловаяСистема.УдалитьВременныйКаталог(АдресВременногоКаталога);
		
		Подробно = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписатьОшибкуВЖурналРегистрации(Подробно);
		
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат Результат;
КонецФункции

Функция ОписанияБик()
	Результат = Новый Структура("bics", Новый Массив());
	
	ТекстJSON = ТекстJSON();
	Если ЗначениеЗаполнено(ТекстJSON) Тогда
		Источник = ОбщегоНазначения.JSONВЗначение(ТекстJSON, "dateIn,dateOut", Ложь);	
		Для Каждого ЭлементИсточника Из Источник.bics Цикл
			ОписаниеЭлементаБИК = НовоеОписаниеЭлементаБик();
			ОписаниеЭлементаБИК.bic = ЭлементИсточника.bic;
			ЗаполнитьЗначенияСвойств(ОписаниеЭлементаБИК.participantInfo, ЭлементИсточника.participantInfo);
			РекурсивноПеренестиЭлементыОписанияБИК(ЭлементИсточника, ОписаниеЭлементаБИК, "Accounts");
			РекурсивноПеренестиЭлементыОписанияБИК(ЭлементИсточника, ОписаниеЭлементаБИК, "Swifts");
			Результат.bics.Добавить(ОписаниеЭлементаБИК);
		КонецЦикла;		
	КонецЕсли;

	Возврат Результат;
КонецФункции

Процедура РекурсивноПеренестиЭлементыОписанияБИК(Источник, Приемник, КлючСвойства)
	СписокИсточник = СвойствоСтруктуры(Источник, КлючСвойства);
	Если НЕ ЗначениеЗаполнено(СписокИсточник) Тогда
		Возврат;
	КонецЕсли;
	
	Приемник[КлючСвойства] = Новый Массив();
	КлючСвойстваНРег = НРег(КлючСвойства);
	Для Каждого ЭлементИсточник Из СписокИсточник Цикл
		Если КлючСвойстваНРег = "accounts" Тогда
			ЭлементПриемник = НовоеОписаниеПолей_account();
		ИначеЕсли КлючСвойстваНРег = "restrictions" Тогда
			ЭлементПриемник = НовоеОписаниеПолей_restriction();
		ИначеЕсли КлючСвойстваНРег = "swifts" Тогда
			ЭлементПриемник = НовоеОписаниеПолей_swift();
		Иначе
			Продолжить;
		КонецЕсли;
		
		Для Каждого КлючИЗначение Из ЭлементИсточник Цикл
			Ключ = КлючИЗначение.Ключ;
			Значение = КлючИЗначение.Значение;
			
			ТипЗначения = ТипЗнч(Значение);
			Если ТипЗначения = Тип("Массив") Тогда
				РекурсивноПеренестиЭлементыОписанияБИК(ЭлементИсточник, ЭлементПриемник, Ключ);
			ИначеЕсли ЭлементПриемник.Свойство(Ключ) И ЗначениеЗаполнено(Значение) Тогда
				ЭлементПриемник[Ключ] = Значение;
			КонецЕсли;
		КонецЦикла;
		
		Приемник[КлючСвойства].Добавить(ЭлементПриемник);
	КонецЦикла;		
КонецПроцедуры

Функция РеквизитыОрганизаций()

	Перем Результат;

	Ключ = "РеквизитыОрганизаций";
	ЛокальныйКэш.Свойство(Ключ, Результат);
	Если Результат = Неопределено Тогда		
		Результат = НовыеРеквизитыОрганизаций();
		
		ОписанияБик = ОписанияБик();
		Для Каждого ОписаниеЭлементаБИК Из ОписанияБик.bics Цикл
			ДобавитьРеквизитыОрганизаций(ОписаниеЭлементаБИК, Результат);
		КонецЦикла;
	
		ЛокальныйКэш.Вставить(Ключ, Результат);
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Процедура ДобавитьРеквизитыОрганизаций(ОписаниеЭлементаБИК, Приемник)
	Список_Accounts = Новый Массив(); // Массив Из см. НовоеОписаниеПолей_account()
	Для Каждого Описание_Account Из ОписаниеЭлементаБИК.Accounts Цикл
		Если ВРег(Описание_Account.Status) = "ACTIVE" Тогда
			Список_Accounts.Добавить(Описание_Account);
		КонецЕсли;
	КонецЦикла;
	Если НЕ ЗначениеЗаполнено(Список_Accounts) Тогда
		НовоеОписаниеПолей_account = НовоеОписаниеПолей_account();
		Список_Accounts.Добавить(НовоеОписаниеПолей_account);
	КонецЕсли;

	Для Каждого Описание_Account Из Список_Accounts Цикл
		РеквизитыОрганизации = Приемник.Добавить();
		ЗаполнитьРеквизитыОрганизации(РеквизитыОрганизации, ОписаниеЭлементаБИК);
		РеквизитыОрганизации.КодБИКРКЦ = Описание_Account.cbrUnitBic;
		РеквизитыОрганизации.КоррСчет = Описание_Account.account;
	КонецЦикла;
КонецПроцедуры

Процедура ЗаполнитьРеквизитыОрганизации(РеквизитыОрганизации, ОписаниеЭлементаБИК)
	Объект_participantInfo = ОписаниеЭлементаБИК.participantInfo;
	
	РеквизитыОрганизации.БИК = ОписаниеЭлементаБИК.BIC;	
	РеквизитыОрганизации.ВнутреннийКодЦБ = Объект_participantInfo.UID;
	РеквизитыОрганизации.Наименование = Объект_participantInfo.Name;	
	РеквизитыОрганизации.ИНН = Объект_participantInfo.INN;
	РеквизитыОрганизации.ОГРН = Объект_participantInfo.OGRN;	
	РеквизитыОрганизации.Город = СокрЛП(Строка(Объект_participantInfo.LocalityType) + " " + Объект_participantInfo.Locality);
	РеквизитыОрганизации.Адрес = Объект_participantInfo.Address;
	РеквизитыОрганизации.Телефоны = Объект_participantInfo.Phones;	
	РеквизитыОрганизации.МеждународноеНаименование = Объект_participantInfo.NameEnglish;
	РеквизитыОрганизации.ГородМеждународный = СтроковыеФункции.СтрокаЛатиницей(РеквизитыОрганизации.Город);
	РеквизитыОрганизации.АдресМеждународный = СтроковыеФункции.СтрокаЛатиницей(РеквизитыОрганизации.Адрес);
	
	РеквизитыОрганизации.Регион = Объект_participantInfo.RegionName;
	Если ЗначениеЗаполнено(РеквизитыОрганизации.Регион) Тогда
		РеквизитыОрганизации.КодРегиона = СокрЛП(Объект_participantInfo.RegionCode);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОписаниеЭлементаБИК.swifts) Тогда
		РеквизитыОрганизации.СВИФТБИК = ОписаниеЭлементаБИК.SWIFTs[0].SWIFT;
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область НайтиСоздатьБанк

Функция НайтиСоздатьБанк(РеквизитыОрганизации)
	Если НЕ ЗначениеЗаполнено(РеквизитыОрганизации.Ссылка) Тогда
		РеквизитыОрганизации.Ссылка = НайтиСоздатьБанкВТранзакции(РеквизитыОрганизации);
	КонецЕсли;
	Возврат РеквизитыОрганизации.Ссылка;	
КонецФункции

Функция ИменаЗагружаемыхРеквизитов()
	Перем Результат;

	Ключ = "ИменаЗагружаемыхРеквизитов";
	ЛокальныйКэш.Свойство(Ключ, Результат);
	Если Результат = Неопределено Тогда
		Результат = Новый Массив();
		РеквизитыОрганизаций = РеквизитыОрганизаций();
		Для Каждого МетаРеквизит Из Метаданные.Справочники.КлассификаторБанков.Реквизиты Цикл
			ЕстьРеквизит = РеквизитыОрганизаций.Колонки.Найти(МетаРеквизит.Имя) <> Неопределено;
			Если ЕстьРеквизит Тогда
				Результат.Добавить(МетаРеквизит.Имя);
			КонецЕсли;			
		КонецЦикла;

		ЛокальныйКэш.Вставить(Ключ, Результат);
	КонецЕсли;

	Возврат Результат;	
КонецФункции

Функция НайтиСоздатьБанкВТранзакции(РеквизитыОрганизации)
	
	НачатьТранзакцию();
	Попытка
		Блокировка = Новый БлокировкаДанных;
		ЭлементБлокировки = Блокировка.Добавить("Справочник.КлассификаторБанков");
		ЭлементБлокировки.УстановитьЗначение("Код", РеквизитыОрганизации.БИК);
		ЭлементБлокировки.УстановитьЗначение("КоррСчет", РеквизитыОрганизации.КоррСчет); 
		Блокировка.Заблокировать();
		
		БанкСсылка = НайтиБанк(РеквизитыОрганизации.БИК, РеквизитыОрганизации.КоррСчет);
		Если ЗначениеЗаполнено(БанкСсылка) Тогда
			БанкОбъект = БанкСсылка.ПолучитьОбъект();
		Иначе
			БанкОбъект = Справочники.КлассификаторБанков.СоздатьЭлемент();
			БанкОбъект.Код = РеквизитыОрганизации.БИК;
			БанкОбъект.КоррСчет = РеквизитыОрганизации.КоррСчет;
		КонецЕсли;
		
		УстановитьРеквизит(БанкОбъект, "Наименование", РеквизитыОрганизации.Наименование);
		УстановитьРеквизит(БанкОбъект, "ПометкаУдаления", Ложь);
		УстановитьРеквизит(БанкОбъект, "ДеятельностьПрекращена", Ложь);
		УстановитьРеквизит(БанкОбъект, "КодСтраны", 643); // Российская Федерация
		
		РегионБанка = РегионБанка(РеквизитыОрганизации);
		УстановитьРеквизит(БанкОбъект, "Родитель", РегионБанка);
		
		БИКРКЦ = НайтиСоздатьБИКРКЦ(РеквизитыОрганизации);		
		УстановитьРеквизит(БанкОбъект, "БИКРКЦ", БИКРКЦ);
		
		ИменаЗагружаемыхРеквизитов = ИменаЗагружаемыхРеквизитов();
		Для Каждого ИмяРеквизита Из ИменаЗагружаемыхРеквизитов Цикл
			НовоеЗначениеРеквизита = РеквизитыОрганизации[ИмяРеквизита];
			УстановитьРеквизит(БанкОбъект, ИмяРеквизита, НовоеЗначениеРеквизита);
		КонецЦикла;
		
		ЗаписатьИзмененный(БанкОбъект);

		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
	Возврат БанкОбъект.Ссылка;
	
КонецФункции

Функция НайтиБанк(БИК, КоррСчет)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	|	КлассификаторБанков.Ссылка КАК Ссылка,
	|	КлассификаторБанков.Код КАК БИК,
	|	КлассификаторБанков.КоррСчет КАК КоррСчет
	|ИЗ
	|	Справочник.КлассификаторБанков КАК КлассификаторБанков
	|ГДЕ
	|	КлассификаторБанков.Код = &БИК
	|	И КлассификаторБанков.КоррСчет = &КоррСчет
	|	И КлассификаторБанков.ЭтоГруппа = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("БИК", БИК);
	Запрос.УстановитьПараметр("КоррСчет", КоррСчет);

	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	Иначе
		Результат = Справочники.КлассификаторБанков.ПустаяСсылка()
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция НайтиСоздатьБИКРКЦ(РеквизитыОрганизации)
	ЕстьБИКРКЦ = ЗначениеЗаполнено(РеквизитыОрганизации.КодБИКРКЦ)
		И РеквизитыОрганизации.БИК <> РеквизитыОрганизации.КодБИКРКЦ;
	Если ЕстьБИКРКЦ Тогда
		РеквизитыОрганизаций = РеквизитыОрганизаций();
		Поиск = Новый Структура("БИК", РеквизитыОрганизации.КодБИКРКЦ);
		РеквизитыОрганизацийПоОтбору = РеквизитыОрганизаций.НайтиСтроки(Поиск);
		Если ЗначениеЗаполнено(РеквизитыОрганизацийПоОтбору) Тогда
			РеквизитыБИКРКЦ = РеквизитыОрганизацийПоОтбору[0];
			Результат = НайтиСоздатьБанк(РеквизитыБИКРКЦ);
		КонецЕсли;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = Справочники.КлассификаторБанков.ПустаяСсылка();
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция РегионБанка(РеквизитыОрганизации)
	Если ЗначениеЗаполнено(РеквизитыОрганизации.КодРегиона) Тогда
		Результат = НайтиСоздатьРегионПоКоду(РеквизитыОрганизации);
	Иначе
		Результат = РегионДругиеТерритории();
	КонецЕсли;
	Возврат Результат;
КонецФункции

Функция РегионДругиеТерритории()
	Перем Результат;

	Ключ = "РегионДругиеТерритории";
	ЛокальныйКэш.Свойство(Ключ, Результат);
	Если Результат = Неопределено Тогда
		НаименованиеРегиона = НСтр("ru = 'Другие территории'");
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КлассификаторБанков.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.КлассификаторБанков КАК КлассификаторБанков
			|ГДЕ
			|	КлассификаторБанков.Наименование = &НаименованиеРегиона
			|	И КлассификаторБанков.ЭтоГруппа = ИСТИНА";
		
		Запрос.УстановитьПараметр("НаименованиеРегиона", НаименованиеРегиона);

		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ОбъектРегиона = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			ОбъектРегиона = Справочники.КлассификаторБанков.СоздатьГруппу();
			ОбъектРегиона.Наименование = НаименованиеРегиона;
		КонецЕсли;		
		УстановитьРеквизит(ОбъектРегиона, "ПометкаУдаления", Ложь);
		
		ЗаписатьИзмененный(ОбъектРегиона);
		Результат = ОбъектРегиона.Ссылка;

		ЛокальныйКэш.Вставить(Ключ, Результат);
	КонецЕсли;

	Возврат Результат;		
КонецФункции

Функция НайтиСоздатьРегионПоКоду(РеквизитыОрганизации)
	
	КэшСвязи = КэшСвязи("НайтиСоздатьРегионПоКоду");
	Результат = КэшСвязи.Получить(РеквизитыОрганизации.КодРегиона);
	Если Результат = Неопределено Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	КлассификаторБанков.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.КлассификаторБанков КАК КлассификаторБанков
			|ГДЕ
			|	КлассификаторБанков.Код = &КодРегиона
			|	И КлассификаторБанков.ЭтоГруппа = ИСТИНА";
		
		Запрос.УстановитьПараметр("КодРегиона", РеквизитыОрганизации.КодРегиона);

		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ОбъектРегиона = Выборка.Ссылка.ПолучитьОбъект();
		Иначе
			ОбъектРегиона = Справочники.КлассификаторБанков.СоздатьГруппу();
			ОбъектРегиона.Код = РеквизитыОрганизации.КодРегиона;
		КонецЕсли;		
		УстановитьРеквизит(ОбъектРегиона, "ПометкаУдаления", Ложь);
		УстановитьРеквизит(ОбъектРегиона, "Наименование", РеквизитыОрганизации.Регион);
		
		ЗаписатьИзмененный(ОбъектРегиона);
		Результат = ОбъектРегиона.Ссылка;

		КэшСвязи.Вставить(РеквизитыОрганизации.КодРегиона, Результат);
	КонецЕсли;
	
	Возврат Результат;	
КонецФункции

#КонецОбласти

#Область Конструкторы

// Новые данные организации.
// 
// Возвращаемое значение:
//  ТаблицаЗначений:
// * Ссылка - СправочникСсылка.КлассификаторБанков
// * ВнутреннийКодЦБ - Строка 
// * Наименование - Строка 
// * БИК - Строка 
// * КоррСчет - Строка 
// * КодБИКРКЦ - Строка 
// * СВИФТБИК - Строка 
// * ИНН - Строка 
// * ОГРН - Строка 
// * Город - Строка 
// * Адрес - Строка 
// * Телефоны - Строка 
// * МеждународноеНаименование - Строка 
// * ГородМеждународный - Строка 
// * АдресМеждународный - Строка 
// * КодРегиона - Строка 
// * Регион - Строка 
// 
Функция НовыеРеквизитыОрганизаций()
	ТипСтрока = Новый ОписаниеТипов("Строка");
	
	Результат = Новый ТаблицаЗначений();
	Результат.Колонки.Добавить("Ссылка", Новый ОписаниеТипов("СправочникСсылка.КлассификаторБанков"));
	Результат.Колонки.Добавить("ВнутреннийКодЦБ", ТипСтрока);
	Результат.Колонки.Добавить("Наименование", ТипСтрока);
	Результат.Колонки.Добавить("БИК", ТипСтрока);
	Результат.Колонки.Добавить("КоррСчет", ТипСтрока);
	Результат.Колонки.Добавить("КодБИКРКЦ", ТипСтрока);
	Результат.Колонки.Добавить("СВИФТБИК", ТипСтрока);
	Результат.Колонки.Добавить("ИНН", ТипСтрока);
	Результат.Колонки.Добавить("ОГРН", ТипСтрока);
	Результат.Колонки.Добавить("Город", ТипСтрока);
	Результат.Колонки.Добавить("Адрес", ТипСтрока);
	Результат.Колонки.Добавить("Телефоны", ТипСтрока);
	Результат.Колонки.Добавить("МеждународноеНаименование", ТипСтрока);
	Результат.Колонки.Добавить("ГородМеждународный", ТипСтрока);
	Результат.Колонки.Добавить("АдресМеждународный", ТипСтрока);
	Результат.Колонки.Добавить("КодРегиона", ТипСтрока);
	Результат.Колонки.Добавить("Регион", ТипСтрока);
	Возврат Результат;
КонецФункции

#Область КонструкторОписанияJSON

// Новое описание элемента бик.
// 
// Возвращаемое значение:
//  Структура:
// * bic - Строка
// * participantInfo - см. НовоеОписаниеПолей_participantInfo
// * accounts - Массив из см. НовоеОписаниеПолей_account
// * swifts - Массив из см. НовоеОписаниеПолей_swift
//
Функция НовоеОписаниеЭлементаБик()
	Результат = Новый Структура;
	Результат.Вставить("bic", "");
	Результат.Вставить("participantInfo", НовоеОписаниеПолей_participantInfo());
	Результат.Вставить("accounts", Новый Массив());
	Результат.Вставить("swifts", Новый Массив());
	Возврат Результат;
КонецФункции

// Новое описание полей participantInfo.
// 
// Возвращаемое значение:
//  Структура:
// * name - Строка
// * registrationNumber - Строка 
// * ogrn - Строка 
// * inn - Строка 
// * dateIn - Строка 
// * type - Строка 
// * uid - Строка 
// * status - Строка 
// * services - Строка 
// * exchangeType - Строка 
// * countryCode - Строка 
// * regionCode - Строка 
// * regionName - Строка 
// * postalCode - Строка 
// * localityType - Строка 
// * locality - Строка 
// * address - Строка 
// * phones - Строка 
// * parentBic - Строка 
// * nameEnglish - Строка 
//
Функция НовоеОписаниеПолей_participantInfo()
	Результат = Новый Структура;
	Результат.Вставить("address", "");
	Результат.Вставить("countryCode", "");
	Результат.Вставить("dateIn", "");
	Результат.Вставить("exchangeType", "");
	Результат.Вставить("inn", "");
	Результат.Вставить("locality", "");
	Результат.Вставить("localityType", "");
	Результат.Вставить("name", "");
	Результат.Вставить("nameEnglish", "");
	Результат.Вставить("ogrn", "");
	Результат.Вставить("parentBic", "");
	Результат.Вставить("phones", "");
	Результат.Вставить("postalCode", "");
	Результат.Вставить("regionCode", "");
	Результат.Вставить("regionName", "");
	Результат.Вставить("registrationNumber", "");
	Результат.Вставить("services", "");
	Результат.Вставить("status", "");
	Результат.Вставить("type", "");
	Результат.Вставить("uid", "");
	Возврат Результат;
КонецФункции
 
// Новое описание полей accounts.
// 
// Возвращаемое значение:
//  Структура:
// * account - Строка 
// * openDate - Строка 
// * controlKey - Строка 
// * cbrUnitBic - Строка 
// * type - Строка 
// * status - Строка 
// * restrictions - Массив из см. НовоеОписаниеПолей_restriction
//
Функция НовоеОписаниеПолей_account()
	Результат = Новый Структура;
	Результат.Вставить("account", "");
	Результат.Вставить("cbrUnitBic", "");
	Результат.Вставить("controlKey", "");
	Результат.Вставить("openDate", "");
	Результат.Вставить("status", "");
	Результат.Вставить("type", "");
	Результат.Вставить("restrictions", Новый Массив());	
	Возврат Результат;
КонецФункции

// Новое описание полей accounts restrictions.
// 
// Возвращаемое значение:
//  Структура:
// * restriction - Строка
// * fromDate - Строка 
//
Функция НовоеОписаниеПолей_restriction()
	Результат = Новый Структура;
	Результат.Вставить("restriction", "");
	Результат.Вставить("fromDate", "");
	Возврат Результат;	
КонецФункции

// Новое описание полей swifts.
// 
// Возвращаемое значение:
//  Структура:
// * swift - Строка 
// * usedByDefault - Булево
// 
Функция НовоеОписаниеПолей_swift()
	Результат = Новый Структура;
	Результат.Вставить("swift", "");
	Результат.Вставить("usedByDefault", Ложь);
	Возврат Результат;
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецОбласти 

#Область Инициализация

ЛокальныйКэш = Новый Структура;

#КонецОбласти 

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
