///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ТекстПредупреждения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
		НСтр("ru = 'Выбранный файл поставки обновления не подходит для установленного приложения
			|%1 (%2)
			|%3 (%4)'"),
		Метаданные.Синоним, Метаданные.Версия, Метаданные.Имя, Метаданные.Поставщик);
	
	ИсходныеКонфигурации = ПолучитьИзВременногоХранилища(Параметры.ИсходныеКонфигурации);
	ЗначениеВРеквизитФормы(ИсходныеКонфигурации, "ОбновлениеДляВерсий");
	
	ПараметрыСообщения = ОбщегоНазначения.ПараметрыВажногоСообщения();
	ПараметрыСообщения.Скрываемый = Ложь;
	ПараметрыСообщения.Сообщение = ТекстПредупреждения;
	ПараметрыСообщения.КраткоеПредставление = НСтр("ru = 'Файл обновления не подходит'");
	ОбщегоНазначения.ДобавитьВажноеСообщение(ЭтотОбъект, ПараметрыСообщения);
	
	ОбщегоНазначения.ВывестиСтатусыИВажныеСообщенияНаФорму(ЭтотОбъект);
КонецПроцедуры

#КонецОбласти

