///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution 4.0 International (CC BY 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПараметрыСообщения = ПользователиСлужебный.ПараметрыСообщения();
	ПараметрыСообщения.ТипСообщения = "Предупреждение";
	ПараметрыСообщения.Группа = Элементы.ГруппаПредупреждение;
	ПараметрыСообщения.Заголовок = НСтр("ru = 'Сведения о пользователе недоступны'");
	ПараметрыСообщения.Сообщение = СтроковыеФункции.ФорматированнаяСтрока(
		НСтр("ru = 'Просмотр сведений о пользователе <b>%1</b> недоступен, так как это служебная учетная запись, предусмотренная для администраторов сервиса.'"),
		Строка(Параметры.Ключ));
	ПользователиСлужебный.ВывестиСообщениеНаФорму(ЭтотОбъект, ПараметрыСообщения);
	
	Если ОбщегоНазначенияКлиентСервер.ЭтоВариантИнтерфейса85() Тогда
		Возврат;
	КонецЕсли;
	
	КоманднаяПанель.ГоризонтальноеПоложение = ГоризонтальноеПоложениеЭлемента.Право;
	ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиФормы.Низ;
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ФормаИзменитьФорму", "Видимость", Ложь);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы,
		"ФормаСправка", "Видимость", Ложь);
	
КонецПроцедуры

#КонецОбласти